#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//操作符

//% 取模操作符的两端必须是整数

/*
int main()
{
	int a = 7 % 2;
	int b = 7 / 2;
	printf("%d\n", a); //1
	printf("%d\n", b); //1
	return 0;
}
*/

//移位操作符
// 移的是二进制

//整数的二进制表示有3种
//原码
//反码
//补码

//正的整数的原码,反码，补码相同
//负的整数的原码,反码，补码是要计算的

//7
//000000000000000000000000000111 - 原码
//000000000000000000000000000111 - 反码
//000000000000000000000000000111 - 补码

//-7
//100000000000000000000000000111 - 原码
//111111111111111111111111111000 - 反码(原码的符号位不变，其他位取反就是反码)
//111111111111111111111111111001 - 补码(反码+1就是补码)

//整数的内存中存储的是补码
//
/*
int main()
{
	int a = 7;

	//左移操作符
	//移动的是二进制位
	int b = a << 1;
	printf("a=%d\n", a);
	printf("b=%d\n", b);
	return 0;
}
*/

/*
int main()
{
	int a = -7;

	//右移操作符
	//移动的是二进制位
	int b = a >> 1;
	printf("a=%d\n", a);//-7
	//算术右移
	printf("b=%d\n", b);//-4
	return 0;
}
*/

// & - 按(2进制)位与
// | - 按(2进制)位或
// ^ - 按(2进制)位异或 - 相同为0,相异为1

/*
int main()
{
	int a = 3;
	int b = -5;
	//int c = a & b;
	//int c = a | b;
	int c = a ^ b;
	//00000000000000000000000000000011 - 3的补码
	//10000000000000000000000000000101
	//11111111111111111111111111111010
	// 
	// 与
	//11111111111111111111111111111011 - -5的补码
	//00000000000000000000000000000011 - 3的补码
	//00000000000000000000000000000011 //3 与的结果
	
	// 或
	//11111111111111111111111111111011 - -5的补码
	//00000000000000000000000000000011 - 3的补码
	//11111111111111111111111111111011
	//11111111111111111111111111111010
	//10000000000000000000000000000101
	//-5 或的结果

	//异或
	//11111111111111111111111111111011 - -5的补码
	//00000000000000000000000000000011 - 3的补码
	//11111111111111111111111111111000
	//11111111111111111111111111110111
	//10000000000000000000000000001000





	//%d 意味着打印一个有符号的整数
	printf("c=%d\n", c);

	return 0;
}
*/

//不能创建临时变量(第三个变量),实现两个数的交换
/*
int main()
{
	int a = 3;
	int b = 5;
	//3^3^5 = 5
	//3^5^3 = 5
	//异或操作符支持交换律
	//011
	//101
	//110
	//011
	//101
	printf("交换前: a=%d b=%d\n", a, b);
	a = a ^ b; 
	b = a ^ b;
	a = a ^ b;
	printf("交换后: a=%d b=%d\n", a, b);
	return 0;
}
*/

//编写代码实现:求一个整数存储在内存中的二进制中1的个数
//求补码的二进制中1的个数

//int a = 3
//00000000000000000000000000000011

//a&1
//00000000000000000000000000000011
//00000000000000000000000000000001
//00000000000000000000000000000001

//方法一
/*
int main()
{
	int num = 10;
	int count = 0;
	while (num)
	{
		if (num % 2 == 1)
			count++;
		num = num / 2;
	}
	printf("二进制中1的个数 = %d\n", count);

	return 0;
}
*/

//方法二
/*
int main()
{
	int num = -1;
	int i = 0;
	int count = 0;
	for (i = 0; i < 32; i++)
	{
		if (num & (1 << i))
		{
			count++;
		}
	}
	printf("二进制中1的个数 = %d\n", count);

	return 0;
}
*/

//方法三
/*
int main()
{
	int num = -1;
	int i = 0;
	int count = 0;
	while (num)
	{
		count++;
		num = num & (num - 1);
	}
	printf("二进制中1的个数 = %d\n", count);

	return 0;
}
*/

//c语言中0表示假，非0表示真

/*
int main()
{
	int a = 10;
	printf("%p\n", &a);
	int* p = &a; //p就是指针变量

	return 0;
}
*/

/*
int main()
{
	int a = 10;
	int n = sizeof(a);//计算的是a所占内存的大小，单位是字节
	//sizeof是一个操作符
	//计算的是变量所占内存空间的大小，单位是字节
	//计算类型所创建的变量占据空间的大小，单位是字节

	printf("n = %d\n", n);

	return 0;
}
*/

/*
int main()
{
	int a = 3;
	int b = 5;
	//int c = a && b;//并且
	int c = a || b;//或者
	printf("%d\n", c);

	return 0;
}
*/

//1.能被4整除,并且不能被100整除
//2.能被400整除是闰年

/*
int is_leap_year(int y)
{
	if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0))
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

int main()
{
	return 0;
}
*/

//&& 左边为假,右边就不计算了
//|| 左边为真,右边就不计算了

/*
int main()
{
	int i = 0, a = 0, b = 2, c = 3, d = 4;
	//i = a++ && ++b && d++;

	i = a++ || ++b || d++;

	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);

	return 0;
}
*/

//条件操作符
//表达式1？ 表达式2: 表达式3
//表达式1为真,表达式2为真，表达式3为假
//表达式1为假,表达式2为假，表达式3为真